# Min Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PickedBox..::..Min Property
PickedBox Class See Also
---
Minimum coordinates (lower-left-rear corner of the pick box).
**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Min { get; set; }
```

Visual Basic
---
```text
Public Property Min As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Min {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# See Also
PickedBox Class
Autodesk.Revit.UI.Selection Namespace